#+property: header-args :session a

#+begin_src python
from rdflib import Graph, URIRef
import rdflib.namespace as rdfns
import json
#+end_src

#+RESULTS:

#+begin_src python
g = Graph()
g.parse("../data/issn_qss.json")
len(g)
#+end_src

#+RESULTS:
: 53

#+begin_src python :session a :results output pp
size = 40
for prefix, namespace in g.namespaces():
    print(f"{prefix : >10} = {namespace}")
#+end_src

#+RESULTS:
#+begin_example
     brick = https://brickschema.org/schema/Brick#
      csvw = http://www.w3.org/ns/csvw#
        dc = http://purl.org/dc/elements/1.1/
      dcat = http://www.w3.org/ns/dcat#
  dcmitype = http://purl.org/dc/dcmitype/
   dcterms = http://purl.org/dc/terms/
      dcam = http://purl.org/dc/dcam/
      doap = http://usefulinc.com/ns/doap#
      foaf = http://xmlns.com/foaf/0.1/
      odrl = http://www.w3.org/ns/odrl/2/
       org = http://www.w3.org/ns/org#
       owl = http://www.w3.org/2002/07/owl#
      prof = http://www.w3.org/ns/dx/prof/
      prov = http://www.w3.org/ns/prov#
        qb = http://purl.org/linked-data/cube#
       rdf = http://www.w3.org/1999/02/22-rdf-syntax-ns#
      rdfs = http://www.w3.org/2000/01/rdf-schema#
    schema = https://schema.org/
        sh = http://www.w3.org/ns/shacl#
      skos = http://www.w3.org/2004/02/skos/core#
      sosa = http://www.w3.org/ns/sosa/
       ssn = http://www.w3.org/ns/ssn/
      time = http://www.w3.org/2006/time#
      vann = http://purl.org/vocab/vann/
      void = http://rdfs.org/ns/void#
       xsd = http://www.w3.org/2001/XMLSchema#
       xml = http://www.w3.org/XML/1998/namespace
       ns1 = http://schema.org/
       ns2 = http://id.loc.gov/ontologies/bibframe/
       ns3 = http://purl.org/ontology/bibo/
#+end_example

#+begin_src python :session b :results output pp
print("hello")
#+end_src

#+RESULTS:
: hello
